# создаем словарь с сообщениями, которые бот будет отправлять пользователю
MESSAGES = {
    'start': 'Здравствуйте, я Ваш персональный Бот-Помощник.\nСейчас я Вам помогу составить объявление в группу\n'
             '"Объявления🗞Губкинский 🏙"\n'
             '\n🚫Правила канала ‼\n'
             '☑Запрещены спамы и посты системы быстрого заработка.\n'
             '☑В одном объявлении не более 3 - х фотографий.\n'
             '☑Реклама запрещённых средств запрещена 🚫\n\n'
             'По техническим причинам обращаться к\nАдминистратору @Dvukraev_Sergey\n'
             'По вопросам рекламы обращаться к\nАдминистратору @kseniaksuxa\n\n',
    'set_description': 'Укажите основной текст поста.',
    'set_photo': '📎Добавьте фото для поста📎\n'
                 'Добавление фото происходит по 1шт, мах 3шт‼\n '
                 'Если фотографии отсутствуют то нажмите кнопку "Объявление без фото❌".\n',
    'next_photo': 'Вы можете отправить еще несколько фото или нажмите "завершить добавление"',
    'confirm_post': 'Вот мы сформировали рекламный пост в группу "Объявления🗞Губкинский🏙"\n'
                    'Ознакомтесь с конечным результатом и нажмите "Сформировать пост".\n'
                    'Если что-то забыли добавить нажмите "Отмена".',
    'canceled': 'Действие отменено.',
    'post_confirmed': 'Пост опубликован.',
    'choose_a_post': 'Для составления объявления выберите нужную категорию.',
    'sale_description': '💰Опишите, что Вы хотите выставить на продажу.\n'
                        '\n'
                        '‼Текст не более 300 символов с соблюдением правил группы (без контактов)‼',
    'set_organisation': '🏢Название организации🏣',
    'purchase_description': '💰Опишите, что Вы хотите купить.\n'
                        '\n'
                        '‼Текст не более 300 символов с соблюдением правил группы (без контактов)‼',
    'question_description': '💰Опишите, что Вы хотите выставить на продажу.\n\n'  # категория вопрос
                        '‼Текст не более 300 символов с соблюдением правил группы (без контактов)‼',
    'too_long_message': '‼Длина текста не должна превышать 300 символов. Попробуйте еще раз‼',
    'ad_description': '💰Опишите, что Вы рекламируете.\n'
                        '\n'
                        '‼Текст не более 300 символов с соблюдением правил группы (без контактов)‼',
    'set_price': '💵Цена данного товара💰',
    'set_contact': '📟Контактный номер или ссылку📱',
    'set_work_time': '🕗Часы работы🕔',
    'bad_words': 'В Вашем посте обнаружена ненормативная лексика. Создайте пост заново, соблюдая правила группы.',
    'del_message': 'Кажется, Вы написали в нашу группу "Объявления🗞Губкинский🏙" Хотите разместить там пост? Нажимайте СТАРТ',
    'auto_delete_message': 'Если Вы хотите разместить пост в группе, то напишите мне @Gubkinski_bot',
    'set_appeal_time': 'Укажите, в какое время к Вам можно обратиться',
    'set_sale': 'Укажите название товара',
    'set_buy': 'Укажите, что Вы хотите купить/снять'
}
