# создаем словарь с сообщениями, которые бот будет отправлять пользователю
MESSAGES = {
    'start': 'Здравствуйте, я бот-постер. Сейчас мы с Вами создадим объявление в группу "Объявления Губкинский"',
    'set_description': 'Укажите основной текст поста.',
    'set_photo': 'Добавьте фото для поста (не более 3) или нажмите "пост без фото".\nФото, которые Вы хотите добавить,'
                 'следует отправлять ПО ОДНОЙ.',
    'next_photo': 'Отправьте мне еще одно фото или нажмите "завершить добавление"',
    'confirm_post': 'Так будет выглядеть пост.\nПодтвердите отправку или нажмите "отмена".',
    'canceled': 'Действие отменено.',
    'post_confirmed': 'Пост опубликован.',
    'choose_a_post': 'Какую категорию поста будем создавать?',
    'sale_description': 'Опишите, что Вы хотите выставить на продажу.\n'
                        'Текст не более 300 символов с соблюдением правил группы (без контактов).',
    'set_organisation': 'Название организации',
    'purchase_description': 'Опишите, что Вы ищите.',
    'question_description': 'Описание Вашего вопроса.',
    'too_long_message': 'Длина текста не должна превышать 300 символов. Попробуйте еще раз.',
    'ad_description': 'Описание рекламы',
    'set_price': 'Цена данного товара',
    'set_contact': 'Контактный номер или ссылку',
    'set_work_time': 'Часы работы',
    'bad_words': 'В Вашем посте обнаружена ненормативная лексика. Создайте пост заново, соблюдая правила группы.',
    'del_message': 'Кажется, Вы написали в нашу группу) Хотите разместить там пост?'
}
