# создаем словарь с сообщениями, которые бот будет отправлять пользователю
MESSAGES = {
    'start': 'Здравствуйте, я Ваш персональный Бот-Помощник.\nСейчас я Вам помогу составить объявление в группу\n'
             '"Объявления🗞Губкинский 🏙"\n\n'
             '🚫Правила группы ‼️\n'
             '☑️Реклама спама и постов системы быстрого заработка запрещенна🚫\n'
             '☑️Реклама материалов 18+ запрещенна🚫\n'
             '☑️Реклама наркотических средств запрещена🚫\n\n'
             '☑️Реклама огнестрельных устройств запрещена🚫\n\n'
             'За не соблюдением правил группы, наказание Бан.\n\n'
             'Убедительная просьба, при формировании объяления указывать текст '
             'без ошибок и указывать понятный и осмыслённый текст.\n\n'
             'По техническим причинам обращаться к\nАдминистратору @Dvukraev_Sergey\n'
             'По вопросам рекламы обращаться к\nАдминистратору @kseniaksuxa\n\n',
    'set_description': 'Укажите основной текст поста.',
    'set_photo': '📎Добавьте фотографию для Вашего поста📎\n'
                 'Добавление фотографий происходит по 1шт, максимально 3шт‼️\n'
                 'Если фотографии отсутствуют то нажмите кнопку "Объявление без фото❌".\n',
    'next_photo': 'Вы можете отправить еще несколько фото или нажмите "завершить добавление"',
    'confirm_post': 'Вот мы сформировали рекламный пост в группу "Объявления🗞Губкинский🏙"\n'
                    'Ознакомтесь с конечным результатом и нажмите "Сформировать пост".\n'
                    'Если что-то забыли добавить нажмите "Отмена".',
    'canceled': 'Ваш пост отменён, попробуйте снова.',
    'post_confirmed': 'Ваш пост опубликован.',
    'choose_a_post': 'Для составления объявления выберите нужную категорию.',
    'sale_description': 'Укажите описание продаваеммого товара📄\n\n'
                        '‼️Текст не более 200 символов с соблюдением правил группы (без контактов)‼️',
    'set_organisation': '🏢 Укажите название организации🏣',
    'purchase_description': 'Укажите описание интерисуеммого товара📄\n\n'
                        '‼️Текст не более 200 символов с соблюдением правил группы (без контактов)‼️',
    'question_description': 'Укажите описание вашей организации📄\n\n'
                            '‼️Текст не более 200 символов с соблюдением правил группы (без контактов)‼️',
    'too_long_message': '‼Длина текста не должна превышать 300 символов. Попробуйте еще раз‼',
    'ad_description': 'Укажите описание вашей организации📄\n\n'
                      '‼️Текст не более 200 символов с соблюдением правил группы (без контактов)‼️',
    'set_question': 'Укажите заголовок Вашего вопроса!',
    'set_price': '💵Цена данного товара💰',
    'set_contact': '📟Контактный номер или ссылку📱',
    'set_work_time': '🕗Укажите, в какое время к Вам можно обратиться🕓',
    'bad_words': 'В Вашем посте обнаружена ненормативная лексика. Создайте пост заново, соблюдая правила группы.',
    'del_message': 'Здравствуйте, я Ваш персональный Бот-Помощник.\nСейчас я Вам помогу составить объявление в группу\n'
                   '"Объявления🗞Губкинский 🏙"\n\n'
                   '🚫Правила канала ‼\n'
                   '☑Запрещены спамы и посты системы быстрого заработка.\n'
                   '☑В одном объявлении не более 3 - х фотографий.\n'
                   '☑Реклама запрещённых средств запрещена 🚫\n\n'
                   'По техническим причинам обращаться к\nАдминистратору @Dvukraev_Sergey\n'
                   'По вопросам рекламы обращаться к\nАдминистратору @kseniaksuxa\n\n',
    'auto_delete_message': 'Если Вы хотите разместить пост в группе, то напишите мне @Gubkinski_bot',
    'set_appeal_time': '🕗Укажите, в какое время к Вам можно обратиться🕓',
    'set_sale': 'Укажите название того что Вы продаёте!',
    'set_buy': 'Укажите, что Вы хотите купить или арендовать!'
}
